



Network Working Group                                          M. Kerwin
Internet-Draft                                            August 9, 2019
Intended status: Standards Track
Expires: February 10, 2020


                      HTTP/2 "Dropped Frame" Frame
                    draft-kerwin-http2-nak-frame-02

Abstract

   This document defines an extension to the Hypertext Transfer Protocol
   Version 2 (HTTP/2) that allows an endpoint to signal to its peer that
   an unsupported extension frame was discarded.

Note to Readers

   The issues list for this draft can be found at
   <https://github.com/phluid61/internet-drafts/labels/
   HTTP%2F2%20NAK%20Frame>

   The most recent (often unpublished) draft is at
   <https://phluid61.github.io/internet-drafts/http2-nak-frame/>

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on February 10, 2020.

Copyright Notice

   Copyright (c) 2019 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Kerwin                  Expires February 10, 2020               [Page 1]

Internet-Draft               http2-nak-frame                 August 2019


   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Notational Conventions  . . . . . . . . . . . . . . . . .   2
   2.  Additions to HTTP/2 . . . . . . . . . . . . . . . . . . . . .   3
     2.1.  DROPPED_FRAME . . . . . . . . . . . . . . . . . . . . . .   3
   3.  Security Considerations . . . . . . . . . . . . . . . . . . .   4
   4.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   4
     4.1.  HTTP/2 Frame Type Registry Update . . . . . . . . . . . .   4
   5.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   5
     5.1.  Normative References  . . . . . . . . . . . . . . . . . .   5
     5.2.  URIs  . . . . . . . . . . . . . . . . . . . . . . . . . .   5
   Appendix A.  Changelog  . . . . . . . . . . . . . . . . . . . . .   5
   Author's Address  . . . . . . . . . . . . . . . . . . . . . . . .   6

1.  Introduction

   Out of the box, the Hypertext Transfer Protocol Version 2 (HTTP/2)
   [RFC7540] makes provision for extension frames to be sent on a
   connection, with or without prior agreement from either peer, with
   the assertion that "implementations MUST discard frames that have
   unknown or unsupported types" ([RFC7540], Section 5.5).  However it
   can be useful to explicitly notify the peer if such a frame is
   discarded.

   This document defines an extension to HTTP/2 that allows a peer to
   signal that a received frame was discarded, without altering the
   stream or connection state ([RFC7540], Section 5.1), and in
   particular without triggering an error condition.

1.1.  Notational Conventions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.






Kerwin                  Expires February 10, 2020               [Page 2]

Internet-Draft               http2-nak-frame                 August 2019


2.  Additions to HTTP/2

   This document introduces a new HTTP/2 frame type ([RFC7540],
   Section 11.2).

2.1.  DROPPED_FRAME

   [[NOTE-1: This is an experimental value; if standardised, a permanent
   value will be assigned. --MK]]

   DROPPED_FRAME frames (type code=0xf1) can be sent on a connection at
   any time after the connection preface except in the middle of a
   header block ([RFC7540], Section 4.3) to indicate that a received
   extension frame was discarded without any other action being taken.

     +---------------+
     |   Type (8)    |
     +---------------+

                        DROPPED_FRAME Frame Payload

   The DROPPED_FRAME frame contains a single 8-bit integer containing
   the value of the Type field from the discarded frame.

   The DROPPED_FRAME frame does not define any flags.

   An endpoint SHOULD send a DROPPED_FRAME frame for an unknown or
   unsupported extension frame type the first time it discards a frame
   of that type.

   An endpoint MAY send a DROPPED_FRAME frame for a particular frame
   type only once, even if it discards multiple frames of that type.

   An endpoint that receives a DROPPED_FRAME frame ought to take it as
   an indication that the extension is not supported by the peer, and
   MAY subsequently choose not to send further frames of that type or to
   attempt extension negotiation with the peer.

   Receipt of a DROPPED_FRAME frame does not necessarily mean that all
   frames on that connection with the discarded type will be discarded
   in future.  A transparent intermediary that forwards an extension
   frame in one direction and a corresponding DROPPED_FRAME frame in the
   other direction MUST NOT intercept future frames of that type and
   preemptively reply with a DROPPED_FRAME frame.

   DROPPED_FRAME frames are not associated with any individual stream.
   If a DROPPED_FRAME frame is received with a stream identifier field




Kerwin                  Expires February 10, 2020               [Page 3]

Internet-Draft               http2-nak-frame                 August 2019


   value other than 0x0, the recipient MUST respond with a connection
   error ([RFC7540], Section 5.4.1) of type PROTOCOL_ERROR.

   Receipt of a DROPPED_FRAME frame with a length field value other than
   1 MUST be treated as a connection error ([RFC7540], Section 5.4.1) of
   type FRAME_SIZE_ERROR.

   An endpoint MUST NOT send a DROPPED_FRAME frame with a Type of
   DROPPED_FRAME (0xf1).  If a DROPPED_FRAME frame is received with a
   Type field value of 0xf1, the recipient MUST respond with a
   connection error ([RFC7540], Section 5.4.1) of type PROTOCOL_ERROR.

   Likewise, an endpoint MUST NOT send a DROPPED_FRAME frame for a type
   it does not discard - including the frame types defined in [RFC7540],
   Section 6, unless otherwise negotiated.  If a DROPPED_FRAME frame is
   received for a type that can not be discarded by the sending peer,
   the recipient MUST respond with a connection error ([RFC7540],
   Section 5.4.1) of type PROTOCOL_ERROR.

   Extensions that define new HTTP/2 frame types MAY specify behaviours
   in response to DROPPED_FRAME frames with those types, however
   extensions that change the semantics of existing protocol components,
   including those defined in this document, MUST be negotiated before
   being used ([RFC7540], Section 5.5).

3.  Security Considerations

   Receipt of a DROPPED_FRAME frame does not guarantee that the sending
   peer will send one for every frame type it drops, and the absence of
   a DROPPED_FRAME frame does not imply that the peer has not discarded
   a frame.  Implementations MUST NOT depend on the use of DROPPED_FRAME
   frames to indicate acceptance or rejection of extension frames.

4.  IANA Considerations

   This document updates the registry for frame types in the "Hypertext
   Transfer Protocol (HTTP) 2 Parameters" section.

4.1.  HTTP/2 Frame Type Registry Update

   This document updates the "HTTP/2 Frame Type" registry ([RFC7540],
   Section 11.2).  The entries in the following table are registered by
   this document.








Kerwin                  Expires February 10, 2020               [Page 4]

Internet-Draft               http2-nak-frame                 August 2019


                  +---------------+------+-------------+
                  | Frame Type    | Code | Section     |
                  +---------------+------+-------------+
                  | DROPPED_FRAME | TBD  | Section 2.1 |
                  +---------------+------+-------------+

5.  References

5.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC7540]  Belshe, M., Peon, R., and M. Thomson, Ed., "Hypertext
              Transfer Protocol Version 2 (HTTP/2)", RFC 7540,
              DOI 10.17487/RFC7540, May 2015,
              <https://www.rfc-editor.org/info/rfc7540>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.


Appendix A.  Changelog

   Since -01:

   o  use experimental value for frame ID

   o  forbid sending a DROPPED_FRAME for any frame that isn't dropped

   Since -00:

   o  Largely editorial; clarifications about when a frame can be
      received and what it can reasonably contain.














Kerwin                  Expires February 10, 2020               [Page 5]

Internet-Draft               http2-nak-frame                 August 2019


Author's Address

   Matthew Kerwin

   Email: matthew@kerwin.net.au
   URI:   https://matthew.kerwin.net.au/













































Kerwin                  Expires February 10, 2020               [Page 6]
